Catalogs/СеткаОстатков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>СеткаОстатков</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Высота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальнаяВысота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальнаяШирина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шаг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ширина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/СеткаОстатков/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.Очистить();
	
	Макет = Справочники.СеткаОстатков.ПолучитьМакет("Макет");
	//ОбластьТело = Макет.ПолучитьОбласть("Тело");
	ОбластьЯчейка = Макет.ПолучитьОбласть("Ячейка");
	ОбластьЦифра = Макет.ПолучитьОбласть("Цифра");
	ШиринаТаблицы = 0;
	ВысотаТаблицы = ?(Объект.Шаг > 0, Объект.Шаг, 100);
	
		
	Пока ШиринаТаблицы <= Объект.МаксимальнаяШирина Цикл
		
		ОбластьЦифра.Параметры.Цифра = ШиринаТаблицы;
		ТабДок.Присоединить(ОбластьЦифра);
		ШиринаТаблицы = ШиринаТаблицы + ?(Объект.Шаг > 0, Объект.Шаг, 100);
		
	КонецЦикла;
		
	Пока ВысотаТаблицы <= Объект.МаксимальнаяВысота Цикл
		
		ШиринаТаблицы = Объект.Шаг;
		ОбластьЦифра.Параметры.Цифра = ВысотаТаблицы;
		ТабДок.Вывести(ОбластьЦифра);
		
		Пока ШиринаТаблицы <= Объект.МаксимальнаяШирина Цикл
		
			ТабДок.Присоединить(ОбластьЯчейка);
			ШиринаТаблицы = ШиринаТаблицы + ?(Объект.Шаг > 0, Объект.Шаг, 100);
			
		КонецЦикла;
		
		ВысотаТаблицы = ВысотаТаблицы + ?(Объект.Шаг > 0, Объект.Шаг, 100);
		
	КонецЦикла;
	
	//ТабДок.Вывести(ОбластьТело);
	
КонецПроцедуры

&НаКлиенте
Процедура ТабДокОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры
